
# 1. Создайте две целочисленные переменные. Распечатайте их сумму, разность и произведение.
# 2. Создайте две переменные с плавающей точкой. Распечатайте их сумму, разность и произведение.
# 3. Создайте две логические переменные. Распечатайте их логическое ИЛИ и И.
# 4.Напишите код ввода имени пользователя и приветствия по введенному имени.

d = 14
m = 8
print(d + m)
print(d - m)
print(d * m)


d = 51
m = 4.8
print(d + m)
print(d - m)
print(d * m)

d = True
m = False
print(d or m)
print(d and m)

user_name = input("Как Вас Зовут? ")
print_text = "Привет, " +user_name+ "!"
print(print_text) 

