# 1.В файлах 06_Blocks.cs и 06_Blocks.php даны наборы программных блоков на C# и PHP. Блоки одни и те же в обоих файлах, они продублированы.  Скачать файлы можно по ссылке единым zip-архивом. Перепишите их на Python в файл 06_Blocks.py
# 2.Выполните полученный код.
# Простой цикл while
i = 7
while i < 10:
    print(i, end=' ')
    i += 1
print(" ")
# Условный оператор
print(" ")
a = 1
b = 5
if a == b:
    print("a равно b")
else:
    print("a не равно b")
print(" ")
# Функция с параметром - контроль делимости на 3
def function_3(a):
    if a%3 == 0:
        print("число делится на 3")
    else:
        print("число не делится на 3")
print(" ")
function_3(9)
function_3(10)


    

	
   


