# 1.Напишите программу для вычисления количества продаж и среднего чека в интервалах: 
# a. До 1000 р включительно
# b. От 1000 р до 3000 р включительно
# c. От 3000 р до 5000 р включительно
# d. Выше 5000 р.
# 2.Список продаж: sales = [2033, 300.50, 1550, 2703, 5110, 2146, 4733, 7114, 1614, 3105, 3155, 853, 10114, 1315]
# 3.Выполняйте полученный код для проверки на каждом новом этапе создания программы.

sales = [2033, 300.50, 1550, 2703, 5110, 2146, 4733, 7114, 1614, 3105, 3155, 853, 10114, 1315]
#sales = [600, 3000, 5000, 7000]
def process_sales(sales):
    # Суммы
    sum1 = 0
    sum2 = 0
    sum3 = 0
    sum4 = 0
    # Количества
    cnt1 = 0
    cnt2 = 0
    cnt3 = 0
    cnt4 = 0
    # Среднее
    avg1 = 0
    avg2 = 0
    avg3 = 0
    avg4 = 0    
    for sale in sales:
        print(sale, end=' ')
        
        if sale <= 1000:
            sum1 += sale
            cnt1 += 1
        elif sale <= 3000:
            sum2 += sale
            cnt2 += 1
        elif sale <= 5000:
            sum3 += sale
            cnt3 += 1
        else:
            sum4 += sale
            cnt4 += 1
        
    print(" ")
    
    if cnt1 > 0:
        avg1 = sum1 / cnt1
    if cnt2 > 0:
        avg2 = sum2 / cnt2
    if cnt3 > 0:
        avg3 = sum3 / cnt3
    if cnt4 > 0:
        avg4 = sum4 / cnt4
    
    print("a. До 1000 р включительно:           Количество продаж = " + str(cnt1) + "  Средний чек = " + "{:.2f}".format(avg1) + " р")
    print("b. От 1000 р до 3000 р включительно: Количество продаж = " + str(cnt2) + "  Средний чек = " + "{:.2f}".format(avg2) + " р")
    print("c. От 3000 р до 5000 р включительно: Количество продаж = " + str(cnt3) + "  Средний чек = " + "{:.2f}".format(avg3) + " р")
    print("d. Выше 5000 р.:                     Количество продаж = " + str(cnt4) + "  Средний чек = " + "{:.2f}".format(avg4) + " р")
    print("Готово!")
    
process_sales(sales)
 

